tap "homebrew/cask"
tap "homebrew/cask-fonts"


# osx binaries
brew "ack"
brew "bash"
brew "coreutils"
brew "ffmpeg"
brew "findutils"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "htop"
brew "httpie"
brew "ledger"
brew "mas"
brew "moreutils"
brew "ncurses"
brew "openssh"
brew "openssl"
brew "screen"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "vim"
brew "wget", args: ["with-iri"]
brew "youtube-dl"
brew "zsh"


# ZSH plugins
brew "autojump"
brew "git-extras"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Development
brew "diff-so-fancy"
brew "gcc"
brew "gradle"
brew "lua"
brew "m4"
brew "make"
brew "nginx"
brew "node"
brew "ocaml"
brew "openjdk"
brew "ruby"
brew "shellcheck"
brew "sqlite"
brew "vlang"
brew "watchman"
brew "yarn"


cask_args appdir: "/Applications"


# Fonts
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-sourcecodepro-nerd-font"


# Applications
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "bartender"
cask "beardedspice"
cask "bettertouchtool"
cask "cyberduck"
cask "docker"
cask "expressvpn"
cask "gpg-suite-no-mail"
cask "handbrake"
cask "hiddenbar"
cask "iterm2"
cask "keybase"
cask "ngrok"
cask "rectangle"
cask "responsively"
cask "spotify"
cask "sourcetree"
cask "steam"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code-insiders"
cask "vlc"
brew "webpquicklook"
cask "zerotier-one"
cask "zoom"

# App Store
mas "Amphetamine", id: 937984704
mas "Aware", id: 1082170746
mas "Balance Lock", id: 1019371109
mas "Boom 2", id: 948176063
mas "Cleaner-App", id: 1013897218
mas "Day One Classic", id: 422304217
mas "Duplicate File Finder", id: 1032755628
mas "Flycut", id: 442160987
mas "Frank DeLoupe", id: 530458789
mas "GeekTool", id: 456877552
mas "Gestimer", id: 990588172
mas "Momentum", id: 1030442215
mas "Shazam", id: 897118787
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "XnConvert", id: 436203431
